/****************************************Copyright (C)**************************************************
**                                  泉州迈韦通信技术有限公司
**                                         研发部 
**                                  http://www.maiwei.com.cn   
**------------------------------------------------------------------------------------------------------
** 文件名称 : hal_wwdg.c 
** 内容描述 : stm32f103vet6平台下wwdg初始化。
**		  					
**------------------------------------------------------------------------------------------------------
** 创 建 者 : Jason
** 版    本 : V1.0
** 创建日期 : 2020-12-12 
**------------------------------------------------------------------------------------------------------
** 修 改 者 : None	
** 版    本 : None	
** 修改日期 : None	
** 内容描述 : None	
********************************************************************************************************/
#include "hal_wwdg.h"

/*********************************************配置区****************************************************/

/*********************************************变量区****************************************************/
const static uint8_t WWDG_MAX_CNT = 0x7F;
const static uint8_t WWDG_MIN_CNT = 0x40;

/*********************************************声明区****************************************************/


/******************************************内部函数区****************************************************/

/********************************************接口区******************************************************/
/*********************************************************************************************************
** 函数名称 ：fWWDG_Init
** 函数功能 ：初始化窗口看门狗，通过配置
** 入口参数 ：cnt: 设置看门狗计数值,最大为0x7f,最小为0x40
** 出口参数 ：成功:0 失败:1
** 作者日期 ：Jason 2020-12-12
**--------------------------------------------------------------------------------------------------------
** 修改作者 ：None
** 修改日期 ：None
** 修改内容 ：None
***********************************************************************************************************/
uint8_t fWWDG_Init(uint8_t  cnt)
{
#if (DEF_STM32F10X_WWDG_EN > 0)
    NVIC_InitTypeDef NVIC_InitStructure;
    
    if((cnt > WWDG_MAX_CNT) || (cnt < WWDG_MIN_CNT))
    {
        return 1;
    }
    
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_WWDG, ENABLE);                        // WWDG 时钟使能

    WWDG_SetPrescaler(WWDG_PRESCALSER);                                         // 设置 IWDG 预分频值
    WWDG_SetWindowValue(WWDG_WINDOW_VALUE);                                     // 设置窗口值
    WWDG_Enable(cnt);                                                           // 使能看门狗,设置 counter
    WWDG_ClearFlag();                                                           // 清除提前唤醒中断标志位
                                                                                
    NVIC_InitStructure.NVIC_IRQChannel = WWDG_IRQn;                             // WWDG 中断
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = WWDG_PREEMPT;        // 抢占优先级 
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = WWDG_SUB;                   // 子优先级
    NVIC_InitStructure.NVIC_IRQChannelCmd=ENABLE;                               
    NVIC_Init(&NVIC_InitStructure);                                             // NVIC 初始化
                                                                                
    WWDG_EnableIT();                                                            // 开启窗口看门狗中断
#endif // DEF_STM32F10X_WWDG_EN
    return 0;
}

/****************************************END OF FILE****************************************************/
